Repository: eugeneai/paper-zont-2017
Catalog: omegat/omegat/project_save.tmx
Source language: ru
Languages: en_us

source: Задача актуальна, прежде всего, в среде малого бизнеса, где нет устоявшихся информационных потоков и связей между документами, что, в основном, обусловлено динамичностью самого бизнеса.
en_us: The task is relevant, especially in a small business environments with no well-established information flows and relationships between documents. This is mainly due to the dynamism [and diversity] of the small business.

source: Закладка браузера является примером такого содержимого.
en_us: Browser bookmarks are examples of such content.

source: Заключение
en_us: Conclusion

source: Значение атрибута class, равное “disp” говорит о возможности подстановки отредактированной в режиме формы строки, идентифицированной id, в текст тега.
en_us: The value of the class attribute equal to “disp” indicates that an edited string identified by id attribute is substitued as the text in this tag.

source: Иркутск, 664033, Россия
en_us: Irkutsk, 664033, Russia

source: Иркутск, 664074, Россия
en_us: Irkutsk, 664033, Russia

source: Иркутского научного центра СО РАН № 4.1.2;
en_us: Irkutsk scientific center of SB RAS No 4.1.2;

source: Использование средств крупномасштабной автоматизации документооборота в такой среде связано с большими материальными затратами на приобретение и/или постоянное усовершенствование программного продукта.
en_us: Use of large-scale workflow automation software in the environments of such kind requires large financial expenses for the purchase and/or continuous improvement of the software product.

source: Использование технологий Linked Open Data при подготовке и публикации текстовых документов
en_us: Linked Open Data technologies for authoring and publishing text documents

source: Использование форматов данных LOD, средств обработки HTML веб-браузера и разработанных технологий позволяет решать широкий класс задач формирования документации, начиная от формирования содержательной части текстов документов, заканчивая представлением стилевых характеристик текстов, а также интегрирования логической разметки в глобальные сервисы доступа к данным.
en_us: The use of LOD data formats, HTML processing tools of web browser and developed technologies allows one to solve a wide class of problems of formation of documentation, ranging from the formation of a meaningful part of the texts through the presentation of stylistic characteristics of the texts and the integration of logical markup into a global data access services.

source: Исходный код проекта доступен в виде модулей языка программирования Python по следующему адресу: https://github.com/isu-enterprise.
en_us: Project source code is available in modules the Python programming language at the following address: https://github.com/isu-enterprise.

source: К программам (предикатам) обеспечивается регламентированный доступ при помощи протокола Pengines [5], для которого реализованы библиотеки для популярных языков программирования, включая клиентский JavaScript, Java, Python.
en_us: An [safe] access to the triples using so called Pengines protocol [5]. There are a number of implementation libraries for the protocols for popular programming languages, including client-side JavaScript, Java, Python.

source: Каждая комбинация отражается в учебном плане вуза, данные из которого ежегодно или два раза в год должны уточняться в рабочих программах.
en_us: Each combination is presented in the curriculum of the university from which data is annually or twice a year should be synchronized in the work programs.

source: Каждая страница сервера представляет какой-либо курс/модуль, представленный в учебном плане.
en_us: Each page represents a course/module presented in a curriculum.

source: Каждый алгоритм вносит в дерево изменения, формирующий окончательное содержание и вид документа.
en_us: Each algorithm changes the tree structure, constructing the final content and layout of the document.

source: Как было сказано выше, использованный формат разметки документов является развитием идей проекта Dokieli (https://github.com/linkeddata/dokieli) [2].
en_us: As was mentioned above, the used the format of the markup of the documents is a development of the project Dokieli (https://github.com/linkeddata/dokieli) [2].

source: Ключевые слова: открытые связанные данные, автоматизация верстки документа, семантическая разметка документа
en_us: Keywords: Linked Open Data, automated composing a document, semantic markup of document

source: Команда taa:content добавляет в документ текст другой страницы, адрес которой формируется интерпретацией параметра, например, taa:content="course:time-differ" включает в текст страницы сгенерированную таблицу распределения часовой нагрузки между видами занятия (лекции, практики, лабораторные, СРС, и т.д.).
en_us: The command taa:content adds text from another page to the current document. The address of the included text is formed by the interpretation of the parameter of the command, for example, taa:content="course:time-differ" adds the text of the table of distribution of time spent between the types of classes (lectures, practice, laboratory works, etc.).

source: Командные структуры распознаются проще, чем структуры семантической разметки.
en_us: The command structures are recognized more easily than the structures of semantic markup.

source: Кроме перечисленных онтологий используются стандартные онтологии (RDF, RDFs, RDFa, XSD) и онтологии из проекта NEPOMUK (https://userbase.kde.org/Nepomuk), предназначенные для описания объектов, хранимых в полнотекстовых индексных цифровых архивах.
en_us: In addition to the above-mentioned ontologies, the standard ontologies (RDF, RDFs, RDFa, XSD) and ontologies from the NEPOMUK project (https://userbase.kde.org/Nepomuk) describing objects stored in the index of full-text digital archives are used as well.

source: Кроме того, в вузах РФ активно ведутся разработки интеллектуальных систем автоматизации обучения, где материал студенту выдаётся в зависимости от предопределенного общего сценария и результатов оценки его знаний.
en_us: In addition, the universities of Russian Federation are developing intelligent systems for training automation where the material the student is given depending on a predefined general scenario and the results of the assessment of the current knowledge.

source: Кроме того, средствами клиентского JavaScript реализованы функции авторизации пользователя согласно стандарта WebID, аннотацию текста другими пользователями в формате Open Annotation в виде комментариев к тексту и закладок.
en_us: In addition, user authentication functions are implemented according to the WebID standard with client-side JavaScript. The system extensively supports commenting (text markup) with Open Annotation (oa).

source: Лермонтова, д.
en_us: Lermontov str.

source: Литература
en_us: References

source: Механизм аннотаций интегрирован с сервисом gitter.im, который показывает комментарии читателей в виде диалога.
en_us: Annotation engine is integrated with gitter.im service, which shows readers' comments in the form of a dialogue.

source: Министерство образования и науки Российской Федерации после ряда экспериментов перешло на широкомасштабное внедрение Болонского процесса в образовательную среду Российской Федерации.
en_us: The Ministry of education and science of the Russian Federation after a series of experiments started the large-scale deployment of the Bologna process in the educational environment of the Russian Federation.

source: Модули интерпретации семантической разметки реализованы в клиентском JavaScript.
en_us: Interpretation modules of the semantic markup are implemented with client-side JavaScript.

source: Модули сканируют структуру дерева документа, распознавая условия их активации.
en_us: The modules scan the tree structure of the document, recognizing the conditions for their activation.

source: Модуль JavaScript ищет теги содержащие набор атрибутов datatype="xsd:string" class="edit" и преобразует текст тега в поле ввода, при этом основной текст недоступен для редактирования.
en_us: The JavaScript module searches for the tags containing a set of attributes datatype="xsd:string", class="edit" and converts the tag text into an input field, the main text is not editable.

source: На основе созданных средств редактирования разработаны варианты цифровых архивов документов, предназначенных для решения задач формирования документации по учебным курсам, оформления результатов исследований высокопроизводительно секвенирования ДНК/РНК.
en_us: The created editing tools are the basis of developed digital archives of documents intended for solving problems of creating documentation of university courses, representing research results of DNA/RNA sequencing.

source: На трудоемком этапе поиска онтологий для представления документов по предметным областям оказался весьма полезным ресурс Linked Open Vocabularies (http://lov.okfn.org/dataset/lov/), а также помощь сообщества исследователей, поддерживающих этот ресурс.
en_us: In our research, there was a labor-intensive stage devoted to the search ontologies to represent documents by subject areas. The resource Linked Open Vocabularies (http://lov.okfn.org/dataset/lov/) happened to be very useful reference book as well as support of the community of researchers, which develop this resource.

source: На этом фоне задача разработки нового учебного пособия теперь кажется более простой, чем раньше.
en_us: The task of developing new handbook now seems to be more simple than before on the background of the document set preparation complexity.

source: Над файловой системой надстроен уровень, позволяющий отслеживать версии документов и развитие документа во времени, создавать интегральные резервные копии.
en_us: The file system bis wrapped with a document versions tracking level to monitor the development of the document in time and create integrated backup copies.

source: Например, большинство постановлений и образовательных стандартов Минобрнауки РФ публикуется в формате PDF, причем в сканированном виде.
en_us: For example, the majority of regulations and education standards of Ministry of education and science of the Russian Federation are published in PDF format in scanned form.

source: Например, при помощи данной онтологии удобно ссылаться на ресурсы (документы), из которых была получена информация, использованная в документе.
en_us: This ontology is a convenient way to refer the document's source parts originated from other documents.

source: Обработка командных структур направлена на преимущественно алгоритмические преобразования текста.
en_us: The command structures interpretation mainly aimed at algorithmic text processing.

source: Одной из задач, решаемых в рамках этого внедрения – переход к компетентностно-ориентированному представлению требований к педагогическому процессу.
en_us: One of the goals to be solved in the introduction is the transition to competence-oriented representation of the requirements to the pedagogical process.

source: Они запускаются, как только основное содержимое загружается в браузер.
en_us: They are executed as soon as the main content is loaded by the browser.

source: Они позволяют более детально описывать метаинформацию о творческом произведении типа файл, изображение, документ, раздел документа, а также задавать тип документа, текстовое содержимое, идентификацию произведений и т.д.
en_us: They allow one to describe meta-information about the creative work of various kind in details, e.g., file, image, document, document section; and specify the type of document, text content, identification of works, etc.

source: Онтологии fibo позволяют задавать роли лиц в документе, например в генеральной доверенности – кто является доверителем, а кто доверенным:
en_us: Fibo ontologies allow specifying the role of entities in the document, e.g., for a general power of attorney, who is the principal (trustor) and who is trusted:

source: Онтология prov – основа описания информационных потоков в документах и их взаимосвязи.
en_us: The prov ontology is a basis of informational flows descriptions in documents and their mutual relationships.

source: Опыт показывает, что преподаватели в большей части не способны справиться с качественным оформлением документов в предоставленные им временные ограничения, что приводит к необходимости руководству кафедр нанимать секретаря-специалиста, функцией которого является доведение предоставленной документации до необходимого уровня качества.
en_us: The raw statistic shows that most teachers are not able to cope with high-quality paperwork in the provided time constraints, resulting in the necessity to departments to hire a secretary, whose function is to bring documentation to the required quality level.

source: Основной модуль – isu.college.
en_us: Main module is isu.college.

source: Основной текст документа, загружаемый в первую очередь, храниться в виде файлов XML в файловой системе на сервере.
en_us: The body of the document loaded in the first place is stored in XML files in the file system on the server.

source: Основную грамматическую форму предложений текста в соответствии с форматом RDFa можно записать в атрибут content, и, например, хранить имена людей в именительном падеже, а в отображаемый текст вставлять подходящее склонение.
en_us: The basic grammatical form of sentences in accordance with the format of the RDFa, one can describe in the content attribute. It allows, e.g., storing peoples' names in the nominative case, and the displayed text to be in a suitable declination.

source: Основные аспекты функционирования модулей рассматривается далее по тексту работы в разделе приложений.
en_us: The main aspects of module functioning is discussed later in the applications section.

source: Основными форматами представления данных таких источников являются PDF, растровые сканы, DJVU, а также форматы Word и Excel.
en_us: The popular data representation formats of the sources are PDF, raster scans, DJVU and Word and Excel formats.

source: От использования rel и about следует отказаться.
en_us: The usage of rel and about should be avoided.

source: Отношения описываются средствами семантического веба и LOD, в основном, конструкциями RDFa и командами, задаваемыми в атрибутах тегов HTML.
en_us: The relations are described by means of semantic web and LOD, i.e., with RDFa structures and commands defined in the attributes of HTML tags.

source: Отображаемая пользователю страница загружается с сервера, где она конструируется из содержимого, хранимого в базе данных или файловой системе, результатов преобразований данных других источников алгоритмами конвертации, и элементов шаблона, который включает в отображаемую страницу интерфейс пользователя для управления представлениями и модулями интерпретации.
en_us: The page is downloaded from a server where it is composed from a content stored in a database or a file system, results of an algorithmic data conversion of other sources, and elements of a template that includes the user view interface elements and interpretation modules on the displayed page.

source: Первая система интересна тем, что полностью реализована на языках Prolog и С, она предоставляет несколько форматов компактного хранения данных, а также тесную интеграцию данных троек со средой программирования языка Prolog.
en_us: The first system is interesting because it is implemented entirely with the programming languages Prolog and C. It supports several formats of compact storage of data, and tight integration of triple data with the runtime and language environment of Prolog.

source: Первое отношение ссылается на аннотируемое содержимое через URI, а второе, которое в общем случае является множественным отношением, - на ресурс-аннотацию, например, на текст-описание ресурса или комментарий, связанный с ресурсом.
en_us: The first relation refers to the annotated content with a corresponding resource URIs, and the second one, which can be multiple, refers to an annotation resource, for example, a text description of the annotated resource or an associated comment.

source: Подготовка юридических документов
en_us: Designing of legal documents

source: Полнотекстовый индекс обеспечивается системой Elasticsearch.
en_us: A full-text index is provided by a Elasticsearch server.

source: Получаемые тексты можно загружать на рабочую станцию пользователя.
en_us: The resulting texts can be downloaded to the user workstation.

source: Последние пять лет показали уровень продуманности принимаемых менеджерами министерства решений в части требований к представлению курса – разработано четыре поколения стандартов (1,2,3 и 3+) –, для которых требовалось представить документы в соответствующей обновленной форме.
en_us: The last five years showed the level of forethought of decisions taken by the managers of the ministry in terms of requirements to the presentation of a course - four generations of the standards (1,2,3 and 3+) have been developed – for each generation the documents in the appropriate "new" form should be prepared.

source: При помощи онтологии dbr удобно ссылаться на конкретные экземпляры объектов и конкретные классы, например, паспорт физического лица (dbr:Passport), конкретный город и т.п.
en_us: Ontology dbr is a convenient way to refer to specific instances of objects and concrete classes, for example, the passport of a person (dbr:Passport), a city, etc.

source: При этом документ формируется из отдельных частей (текстов и изображений), загружаемых с других серверов при помощи ссылок на соответствующие ресурсы.
en_us: The document is constructed out of individual parts (text and images) that are loaded from other servers with links to relevant resources.

source: При этом обеспечены загрузка фрагментов текста из других документов и их порождение серверными и клиентскими скриптами.
en_us: The functions support uploading of text fragments from other documents and their generation with server and client scripts.

source: Приведем пример представления текста доверенности с грамматическими конструкциями.
en_us: Here is an example of text view of the power of attorney with grammatical structures.

source: Приведены несколько примеров использования разработанных средств верстки для подготовки документов в образовательной среде, подготовки юридических документов и др.
en_us: A few examples of the use of the developed tools has been presented in an educational environment, preparation of legal documents etc.

source: Приложения созданных технологий
en_us: Applications of the technologies

source: Проводимая реформа затрагивает все аспекты процесса, включая систему классификации специальностей (внедрение программ м направлений, специализация по уровням квалификации (бакалавриат, магистратура и др.), введение прикладного бакалавриата, перечень преподаваемых курсов, целей и задач курсов (согласование с компетенциями, заданными в Федеральном государственном стандарте), формы ведения занятий в вузе (введение интерактивных форм обучения), распределение лекционных и практических занятий и др.
en_us: The reform affects all aspects of the process, including the system of classification of professions, introduction of "programs" and "directions", specialization by skill level (bachelor, master, etc.), introduction of applied bachelor degree, list of courses, goals and objectives of the courses agreed with the competencies specified in the Federal state educational standard, forms of conducting classes, e.g., the introduction of interactive forms, the distribution of lectures and practical sessions, etc.

source: Программные системы - аналоги
en_us: Analogs of the software system under development

source: Проект ориентирован на создание средств редактирования текстов HTML5, представляющих научные публикации, несколькими соавторами.
en_us: The project focuses on implementation of HTML5 text-editing tools for authoring a scientific publication by several co-authors.

source: Проект представляет собой WYSIWIG-редактор размеченных LOD HTML-страниц, стилей (CSS) отображения и встроенного подграфа (его содержимое не видно в документе), представленного в различных форматах (TTL, N3, JSON-LD, TriG).
en_us: The project is a WYSIWYG-editor of LOD marked up HTML pages, display style sheet (CSS) and built-in subgraph (its content is not visible on the page) presented in different formats (TTL, N3, JSON-LD, TriG).

source: Развитие средств представления документов на основе LOD направлено на формирование прототипа глобальной среды, поддерживающей автоматизацию передачи информации между документами нескольких предприятий, и создание, в идеале, распределенного документооборота по принципам социальной сети.
en_us: The development of the tools for document representation on the basis of LOD aimed at the formation of the prototype of a global environment that supports automation of data transfer between documents of several companies, and create, ideally, a distributed document processing with the principles of social networks.

source: Разметка LOD для табличных данных неструктурированных источников описывается при помощи онтологии qb (Qube ontology), которая позволяет представлять эти данные в виде гиперкуба.
en_us: LOD markup for the tabular data taken from the unstructured sources is described using the ontology qb (Qube ontology), which allows presenting the data as a hypercube.

source: Разметка документов в этом проекте аналогична разметке, используемой в предыдущем примере, добавлено несколько онтологий для представления юридически-значимых терминов: fibo (The Financial Industry Business Ontology) и формальных спецификаций удостоверяющих документов acrt (A Certification Ontology).
en_us: The markup documents in this project is similar to the one used in the previous example, a number of ontologies for representation of significant terms in the legal domain were added: fibo (The Financial Industry Business Ontology), and formal specifications of identity documents acrt (A Certification Ontology).

source: Разметка таблицы в qb позволяет алгоритмически обрабатывать ее непосредственно, т.е. без необходимости предварительного анализа структуры.
en_us: The qb markup allows direct algorithmic processing for the table, i.e., without additional analysis of the structure.

source: Размеченный методический и документальный материал позволит частично автоматизировать процесс заполнения базы модулей такой системы электронного обучения.
en_us: Marked up methodological and documentary material could be used for partial automation of the process of populating the module databases of e-learning systems.

source: Разрабатываемые программные средства верстки текста документов базируются на технологиях, реализующих стандарт HTML5, существующих в современных веб-браузерах.
en_us: The developed software for typesetting of text documents are based on technologies, which implement the HTML5 standard available in modern web browsers.

source: Разработан программный инструментарий, позволяющий сверстывать HTML5-документы из различных источников: веб-страниц и результатов обработки текста на стороне клиента (веб-браузера), а также представлять документ в заданном виде, например, как шаблон или форму.
en_us: Software tools to compose HTML5 documents from various sources and present the document in a specified layout, such as a template or form, is being developed. The sources are web pages and the results of text processing on the server or client side (web browser) processing results.

source: Разработанные средства верстки документов использованы в решении ряда прикладных задач.
en_us: The tools developed for typesetting documents are used in solution of applied problems.

source: Разработаны тестовые варианты хранилищ на разных языках программирования.
en_us: Test storages are implemented for different programming languages.
